tap "homebrew/core"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Core shell + dotfiles dependencies
brew "bash"
brew "bat"
brew "bottom"
brew "btop"
brew "coreutils"
brew "curl"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "glow"
brew "gnupg"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "just"
brew "lazygit"
brew "neovim"
brew "procs"
brew "ripgrep"
brew "shellcheck"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "unzip"
brew "uv"
brew "xh"
brew "yazi"
brew "zoxide"

# Fonts used by powerlevel10k and terminal prompts.
cask "font-meslo-lg-nerd-font"
