# Core shell + dotfiles dependencies
brew "atuin"
brew "bash"
brew "azure-cli"
brew "bat"
brew "bottom"
brew "bun"
brew "btop"
brew "coreutils"
brew "curl"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "gh"
brew "glow"
brew "gping"
brew "helm"
brew "herdr"
brew "gnupg"
brew "httpie"
brew "hyperfine"
brew "jq"
brew "duf"
brew "just"
brew "kubectl"
brew "direnv"
brew "lazygit"
brew "miller"
brew "neovim"
brew "age"
brew "procs"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "stow"
brew "tealdeer"
brew "tmux"
brew "unzip"
brew "uv"
brew "xh"
brew "yazi"
brew "zoxide"

# macOS GUI apps
cask "ghostty"
cask "claude-code"
cask "codex"
cask "homebrew/cask/copilot-cli"
cask "visual-studio-code@insiders"
cask "zed"
